import React from "react";
import { NavbarItem } from "../index";

interface Props {
	direction: string;
}

const itemsContent = [
	{
		id: 1,
		href: "/",
		svgPathD1:
			"M2.25 12l8.954-8.955c.44-.439 1.152-.439 1.591 0L21.75 12M4.5 9.75v10.125c0 .621.504 1.125 1.125 1.125H9.75v-4.875c0-.621.504-1.125 1.125-1.125h2.25c.621 0 1.125.504 1.125 1.125V21h4.125c.621 0 1.125-.504 1.125-1.125V9.75M8.25 21h8.25",
		svgPathD2: "",
		textContent: "صفحه اصلی",
	},
	{
		id: 2,
		href: "/confirmation",
		svgPathD1:
			"M8.625 9.75a.375.375 0 11-.75 0 .375.375 0 01.75 0zm0 0H8.25m4.125 0a.375.375 0 11-.75 0 .375.375 0 01.75 0zm0 0H12m4.125 0a.375.375 0 11-.75 0 .375.375 0 01.75 0zm0 0h-.375m-13.5 3.01c0 1.6 1.123 2.994 2.707 3.227 1.087.16 2.185.283 3.293.369V21l4.184-4.183a1.14 1.14 0 01.778-.332 48.294 48.294 0 005.83-.498c1.585-.233 2.708-1.626 2.708-3.228V6.741c0-1.602-1.123-2.995-2.707-3.228A48.394 48.394 0 0012 3c-2.392 0-4.744.175-7.043.513C3.373 3.746 2.25 5.14 2.25 6.741v6.018z",
		svgPathD2: "",
		textContent: "کد تایید",
	},
	{
		id: 4,
		href: "/booking",
		svgPathD1:
			"M11.35 3.836c-.065.21-.1.433-.1.664 0 .414.336.75.75.75h4.5a.75.75 0 00.75-.75 2.25 2.25 0 00-.1-.664m-5.8 0A2.251 2.251 0 0113.5 2.25H15c1.012 0 1.867.668 2.15 1.586m-5.8 0c-.376.023-.75.05-1.124.08C9.095 4.01 8.25 4.973 8.25 6.108V8.25m8.9-4.414c.376.023.75.05 1.124.08 1.131.094 1.976 1.057 1.976 2.192V16.5A2.25 2.25 0 0118 18.75h-2.25m-7.5-10.5H4.875c-.621 0-1.125.504-1.125 1.125v11.25c0 .621.504 1.125 1.125 1.125h9.75c.621 0 1.125-.504 1.125-1.125V18.75m-7.5-10.5h6.375c.621 0 1.125.504 1.125 1.125v9.375m-8.25-3l1.5 1.5 3-3.75",
		svgPathD2: "",
		textContent: "نوبت دهی",
	},
];

export default function Navbar({ direction }: Props) {
	return (
		<>
			<nav>
				<ul className={`flex ${direction} gap-5 sm:gap-10 md:gap-16 text-xl text-slate-600`}>
					{itemsContent.map(({ id, href, svgPathD1, svgPathD2, textContent }) => {
						return <NavbarItem key={id} href={href} svgPathD1={svgPathD1} svgPathD2={svgPathD2} textContent={textContent} />;
					})}
				</ul>
			</nav>
		</>
	);
}
